src/cf/InformationRegisters/НастройкиШаблоновИмени.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>НастройкиШаблоновИмени</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ШаблонИмени</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныИменФайлов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТипОбъекта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыОбъектовШаблоновИмениФайла</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДокументов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РольФайла</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РолиФайлов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/НастройкиШаблоновИмени/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Очистить все записи по шаблону.
// 
// Параметры:
//  ШаблонИмени  - СправочникССылка.ШаблоныИменФайлов
Процедура ОчиститьЗаписиПоШаблону(ШаблонИмени) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиШаблоновИмени.ТипОбъекта КАК ТипОбъекта,
		|	НастройкиШаблоновИмени.Вид,
		|	НастройкиШаблоновИмени.РольФайла
		|ИЗ
		|	РегистрСведений.НастройкиШаблоновИмени КАК НастройкиШаблоновИмени
		|ГДЕ
		|	НастройкиШаблоновИмени.ШаблонИмени = &ШаблонИмени";
	
	Запрос.УстановитьПараметр("ШаблонИмени", ШаблонИмени );
	Результат = Запрос.Выполнить();
	
	// сперва все сотрем
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НаборЗаписей = РегистрыСведений.НастройкиШаблоновИмени.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ТипОбъекта.Установить(Выборка.ТипОбъекта);
		НаборЗаписей.Отбор.Вид.Установить(Выборка.Вид);
		НаборЗаписей.Отбор.РольФайла.Установить(Выборка.РольФайла);
		НаборЗаписей.Записать();
		
	КонецЦикла;	
	
КонецПроцедуры	

#КонецОбласти

#КонецЕсли
